"""
Представлен список чисел. Необходимо вывести те его элементы, значения которых больше предыдущего, например:
src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
result = [12, 44, 4, 10, 78, 123]
"""



def listgen(nums:list) -> int:
    '''
    Не учитывает вариант со списком нулевой длины
    :param nums:list
    :return: list generator
    '''
    for i in range(1, len(nums)):
        if nums[i] > nums[i-1]:
            yield nums[i]


if __name__ == '__main__':
    src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
    print(list(listgen(src)))

'''
[12, 44, 4, 10, 78, 123]
'''
